"""OJ3036 [LEARNING LOGS]"""
import math
n = int(input())
row = (math.ceil(math.sqrt(n))) # คำนวนหาแถวที่ n อยู่
first_room = ((row - 1) ** 2) + 1 # เลขของห้องแรกของแถวที่ n อยู่

position = n - first_room # ความห่างของห้องแรกกับห้อง n ในแถวที่ row
# ห่างกันเป็นเลขคี่หมายความว่าห้องที่ n เป็นสามเหลี่ยมแบบกลับหัว (ทำลาย 1 กำแพงไปชั้นถัดไปได้)
# ห่างกันเป็นเลขคู่หมายความว่าห้องที่ n เป็นสามเหลี่ยมแบบปกติ (ทำลาย 2 กำแพงไปชั้นถัดไปได้)
if position % 2:
    print(2 * (row - 1) - 1) # ห่างเป็นเลขคี่ สามเหลี่ยมแบบกลับหัว
else:
    print(2 * (row - 1)) # ห่างเป็นเลขคู่ สามเหลี่ยมแบบปกติ
