"""OJ3036 [LEARNING LOGS]"""
import math
n = int(input())
row = (math.ceil(math.sqrt(n))) #คำนวนหาแถวที่เริ่ม
count = 0
while n != 1:
    if n % 2: # เลขห้องหาร 2 ลงตัวมั้ย
        # หารไม่ลงตัว
        if row % 2: # แถวปัจจุบันหาร 2 ลงตัวมั้ย
            # ไม่ลงตัว
            last_up_line = (row - 1) ** 2 #เลขสุท้ายบรรทัดบน
            last_in_line = ((row ** 2)) #เลขสุท้ายบรรทัดที่อยู่
            x = math.ceil((last_in_line + last_up_line) / 2) #เลขตรงกลาง
            # อยู่ด้านซ้ายของตรงกลางและไม่ใช้ห้องซ้ายสุด หรือ ห้องขวาสุด มั้ย
            if (n <= x and (n - last_up_line) != 1) or( n == (row ** 2)):
                # ใช่
                n -= 1 #ขยับไปห้องซ้าย
            else:
                n += 1 #ขยับไปห้องขวา
        else:
            # ลงตัว
            n -= (2 * (row - 1)) # ไปห้องถัดไป
            row -= 1 # ขยับแถวขึ้น
    else:
        # หารลงตัว
        if row % 2: # แถวปัจจุบันหาร 2 ลงตัวมั้ย
            # ไม่ลงตัว
            n -= (2 * (row - 1)) # ไปห้องถัดไป
            row -= 1 # ขยับแถวขึ้น
        else:
            # ลงตัว
            last_up_line = (row - 1) ** 2 #เลขสุท้ายบรรทัดบน
            last_in_line = ((row ** 2)) #เลขสุท้ายบรรทัดที่อยู่
            x = math.ceil((last_in_line + last_up_line) / 2) #เลขตรงกลาง
            if n <= x and n != (row ** 2): # อยู่ด้านซ้ายของตรงกลางและไม่ใช้ห้องห้องขวาสุด
                n += 1 #ขยับไปห้องขวา
            else:
                n -= 1 #ขยับไปห้องซ้าย
    count += 1 #พังกำแพงไปอีก 1
print(count)
